set_property SRC_FILE_INFO {cfile:F:/smdp/xup/Day-2_fpga_flow/lab4/sources/wave_gen_timing.xdc rfile:../../../Day-2_fpga_flow/lab4/sources/wave_gen_timing.xdc id:1} [current_design]
set_property SRC_FILE_INFO {cfile:f:/smdp/xup/Day-2_fpga_flow/lab4/sources/ip/artix7/char_fifo/char_fifo/char_fifo_clocks.xdc rfile:../../../Day-2_fpga_flow/lab4/sources/ip/artix7/char_fifo/char_fifo/char_fifo_clocks.xdc id:2 order:LATE scoped_inst:char_fifo_i0/U0} [current_design]
set_property src_info {type:XDC file:1 line:15 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -rise_from [get_clocks -of_objects [get_nets clk_tx]] -through [get_ports spi_clk_pin] -fall_to [get_clocks clk_pin]
set_property src_info {type:XDC file:1 line:16 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -fall_from [get_clocks -of_objects [get_nets clk_tx]] -through [get_ports spi_clk_pin] -rise_to [get_clocks clk_pin]
set_property src_info {type:XDC file:1 line:27 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name clk_samp -source [get_pins {clk_gen_i0/clk_core_i0/clk_out2}] -divide_by 32 [get_pins {clk_gen_i0/BUFHCE_clk_samp_i0/O}]
set_property src_info {type:SCOPED_XDC file:2 line:59 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_cells inst_fifo_gen/gconvfifo.rf/grf.rf/gntv_or_sync_fifo.gcx.clkx/rd_pntr_gc_reg[*]] -to [get_cells inst_fifo_gen/gconvfifo.rf/grf.rf/gntv_or_sync_fifo.gcx.clkx/gsync_stage[*].wr_stg_inst/Q_reg_reg[*]] -datapath_only [get_property -min PERIOD [get_clocks -of_objects [get_pins char_fifo_i0/U0/rd_clk]]]
set_property src_info {type:SCOPED_XDC file:2 line:61 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [get_cells inst_fifo_gen/gconvfifo.rf/grf.rf/gntv_or_sync_fifo.gcx.clkx/wr_pntr_gc_reg[*]] -to [get_cells inst_fifo_gen/gconvfifo.rf/grf.rf/gntv_or_sync_fifo.gcx.clkx/gsync_stage[*].rd_stg_inst/Q_reg_reg[*]] -datapath_only [get_property -min PERIOD [get_clocks -of_objects [get_pins char_fifo_i0/U0/wr_clk]]]
