set_property SRC_FILE_INFO {cfile:F:/smdp/xup/Day-1_fpga_flow/lab2/sources/uart_led_pins_basys3.xdc rfile:../../../../../../lab2/sources/uart_led_pins_basys3.xdc id:1} [current_design]
set_property SRC_FILE_INFO {cfile:F:/smdp/xup/Day-1_fpga_flow/lab2/sources/uart_led_timing.xdc rfile:../../../../../../lab2/sources/uart_led_timing.xdc id:2} [current_design]
set_property src_info {type:XDC file:2 line:3 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 10.000 -name clk_pin -waveform {0.000 5.000} [get_ports clk_pin]
set_property src_info {type:XDC file:2 line:6 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 10.000 -name virtual_clock -waveform {0.000 5.000}
set_property src_info {type:XDC file:2 line:9 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock clk_pin 0.000 [get_ports rxd_pin]
set_property src_info {type:XDC file:2 line:10 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock clk_pin -min -0.500 [get_ports rxd_pin]
set_property src_info {type:XDC file:2 line:12 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock virtual_clock -max 0.000 [get_ports btn_pin]
set_property src_info {type:XDC file:2 line:13 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock virtual_clock -min -0.500 [get_ports btn_pin]
set_property src_info {type:XDC file:2 line:16 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock virtual_clock 0.000 [get_ports {led_pins[*]}]
